Autodesk.Revit.UI.IManageLinkServerBaseProxy.OnPathTypesChanged(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.UI.ExternalDataManagerDataItemId},System.String)
Handles the path type change, from absolute to relative or vice versa.

Autodesk.Revit.UI.IManageLinkServerBaseProxy.OnPathTypeChanged(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.ExternalDataManagerDataItemId,System.String)
Handles the path type change, from absolute to relative or vice versa.